In [1]:
# importing necessary libraries.

import numpy as np
import pandas as pd

In [2]:
# reading the given data excel file as a Pandas dataframe

df= pd.read_excel('Exercise Data.xlsx')

In [3]:
df.head()

  Unnamed: 0  ...                                Unnamed: 5
0      Month  ...  Amount returned to everyone in the group
1          1  ...                                       400
2          2  ...                                       320
3          3  ...                                       200
4          4  ...                                        80

[5 rows x 6 columns]

In [4]:
# replacing header with top row

df = df.rename(columns=df.iloc[0]).drop(df.index[0])

In [5]:
df.head()

  Month  ... Amount returned to everyone in the group
1     1  ...                                      400
2     2  ...                                      320
3     3  ...                                      200
4     4  ...                                       80
5     5  ...                                      400

[5 rows x 6 columns]

In [6]:
# calculating the total sum of surplus amount that is to be returned to everyone

df['Amount returned to everyone in the group'].sum()

6200

In [7]:
# amount received by the first bidder is =

df['Net amount recd by Bid winner'][1]

37500

In [8]:
# amount received by the last bidder is = 

df['Net amount recd by Bid winner'][25] + df['Amount returned to everyone in the group'].sum()

53700

In [9]:
# creating a list to keep a record of how much the bidder received from the surplus

list=[]
column = df['Amount returned to everyone in the group']

sum = 0
list.append(0)
for amount in column[:len(column) - 1]:
    sum += amount
    list.append(sum)

In [10]:
list

[0,
 400,
 720,
 920,
 1000,
 1400,
 1720,
 2000,
 2240,
 2640,
 2960,
 3160,
 3240,
 3640,
 3960,
 4240,
 4520,
 4880,
 5200,
 5400,
 5600,
 5840,
 6000,
 6120,
 6200]

In [11]:
#adding the list to the dataframe as a new column

df['Remaining amount received by the bid winner'] = list

In [12]:
''' 
adding a new column to calculate the total amount recieved by the bid winner =
Remaining amount returned to the bid winner + Net amount recieved by the bid winner

'''

df['Total amount received by the bid winner'] = df['Net amount recd by Bid winner'] + df['Remaining amount received by the bid winner']

In [13]:
df

   Month  ... Total amount received by the bid winner
1      1  ...                                   37500
2      2  ...                                   39900
3      3  ...                                   43220
4      4  ...                                   46420
5      5  ...                                   38500
6      6  ...                                   40900
7      7  ...                                   42220
8      8  ...                                   43500
9      9  ...                                   39740
10    10  ...                                   42140
11    11  ...                                   45460
12    12  ...                                   48660
13    13  ...                                   40740
14    14  ...                                   43140
15    15  ...                                   44460
16    16  ...                                   44740
17    17  ...                                   43020
18    18  ...                                   44380
19    19  ...                                   47700
20    20  ...                                   47900
21    21  ...                                   47100
22    22  ...                                   49340
23    23  ...                                   50500
24    24  ...                                   51620
25    25  ...                                   53700

[25 rows x 8 columns]

In [14]:
#calculating each month's bid winner return %

df['Each month\'s bid winner return %'] = (df['Total amount received by the bid winner']/50000)*100

In [15]:
df

   Month  ... Each month's bid winner return %
1      1  ...                               75
2      2  ...                             79.8
3      3  ...                            86.44
4      4  ...                            92.84
5      5  ...                               77
6      6  ...                             81.8
7      7  ...                            84.44
8      8  ...                               87
9      9  ...                            79.48
10    10  ...                            84.28
11    11  ...                            90.92
12    12  ...                            97.32
13    13  ...                            81.48
14    14  ...                            86.28
15    15  ...                            88.92
16    16  ...                            89.48
17    17  ...                            86.04
18    18  ...                            88.76
19    19  ...                             95.4
20    20  ...                             95.8
21    21  ...                             94.2
22    22  ...                            98.68
23    23  ...                              101
24    24  ...                           103.24
25    25  ...                            107.4

[25 rows x 9 columns]

## What is the Annualized Return of the person who bids in the last month ?

In [18]:
df["Total amount received by the bid winner"][25]

53700

## What is the Annualized Return of the person who bids in the first month ?

In [19]:
df["Total amount received by the bid winner"][1]

37500

## Return % for each month's bid winner

In [20]:
df["Each month's bid winner return %"]

1         75
2       79.8
3      86.44
4      92.84
5         77
6       81.8
7      84.44
8         87
9      79.48
10     84.28
11     90.92
12     97.32
13     81.48
14     86.28
15     88.92
16     89.48
17     86.04
18     88.76
19      95.4
20      95.8
21      94.2
22     98.68
23       101
24    103.24
25     107.4
Name: Each month's bid winner return %, dtype: object